{"id": "BUD001", "title": "Craving", "paragraphs": ["In Buddhism, craving (tanha) is considered one of the root causes of suffering (dukkha). It is the second Noble Truth and represents the origin of suffering through desire, attachment, and thirst for sensual pleasures."]}
{"id": "BUD002", "title": "Sensual Desire", "paragraphs": ["Kama-tanha refers to craving for sensual pleasures, one of the three types of craving identified by the Buddha. It includes desires related to the five senses and represents attachment to pleasant experiences."]}
{"id": "BUD003", "title": "Existence Craving", "paragraphs": ["Bhava-tanha is the craving for existence or becoming, reflecting the desire to perpetuate one's existence and the attachment to eternal life or continued existence in various realms."]}
{"id": "BUD004", "title": "Non-existence Craving", "paragraphs": ["Vibhava-tanha represents the craving for non-existence or self-annihilation, often arising from aversion to suffering and the desire to escape from unpleasant experiences."]}
{"id": "BUD005", "title": "Attachment", "paragraphs": ["Upadana refers to clinging or attachment, which is closely related to craving. It represents the intensification of desire and leads to continued existence in samsara."]}
{"id": "BUD006", "title": "Desire", "paragraphs": ["Raga refers to lust or passion, a form of craving that leads to attachment and suffering in the cycle of existence."]}
{"id": "BUD007", "title": "Greed", "paragraphs": ["Lobha is one of the three unwholesome roots, representing excessive desire and attachment to material possessions and experiences."]}
{"id": "BUD008", "title": "Thirst", "paragraphs": ["The metaphorical thirst (pipasa) represents the insatiable nature of craving, constantly seeking satisfaction through various objects and experiences."]}
{"id": "BUD009", "title": "Material Craving", "paragraphs": ["Ruppa-tanha refers to craving for material forms and physical objects, including attachment to bodily appearance and material possessions."]}
{"id": "BUD010", "title": "Mental Craving", "paragraphs": ["Arupa-tanha represents craving for mental states, ideas, and conceptual experiences, including spiritual attainments."]}
{"id": "BUD011", "title": "Addiction", "paragraphs": ["In Buddhist context, addiction represents an extreme form of craving that leads to compulsive behavior and suffering."]}
{"id": "BUD012", "title": "Sense Pleasures", "paragraphs": ["Kamaguna refers to the five strands of sense pleasure that often become objects of craving and attachment."]}
{"id": "BUD013", "title": "Hunger", "paragraphs": ["Jighaccha is used metaphorically to describe the perpetual hunger of craving that can never be fully satisfied."]}
{"id": "BUD014", "title": "Renunciation", "paragraphs": ["Nekkhamma is the antidote to craving, representing the voluntary letting go of desires and attachments."]}
{"id": "BUD015", "title": "Contentment", "paragraphs": ["Santutthi is the quality of being content, serving as an antidote to endless craving and desire."]}
{"id": "BUD016", "title": "Obsession", "paragraphs": ["Nandi-raga refers to the delight and lust that leads to obsessive attachment and continued existence in samsara."]}
{"id": "BUD017", "title": "Mental Proliferation", "paragraphs": ["Papanca describes the tendency of mind to create elaborate patterns of craving and conceptual thinking."]}
{"id": "BUD018", "title": "Acquisitiveness", "paragraphs": ["Upadana in the context of craving refers to the drive to acquire and accumulate both material and immaterial things."]}
{"id": "BUD019", "title": "Food Craving", "paragraphs": ["Ahara-tanha represents specific craving for food and nourishment, often used as an example of sensual desire."]}
{"id": "BUD020", "title": "Identity Craving", "paragraphs": ["Bhava-tanha specifically related to craving for particular states of being or identity formations."]}

{"id": "BUD021", "title": "Mindfulness", "paragraphs": ["Sati, or mindfulness, is the practice of maintaining awareness of the present moment, including thoughts, feelings, bodily sensations, and surrounding environment."]}
{"id": "BUD022", "title": "Concentration", "paragraphs": ["Samadhi refers to mental concentration or one-pointedness of mind, developed through meditation practice. It is essential for developing insight and wisdom."]}
{"id": "BUD023", "title": "Walking Meditation", "paragraphs": ["Cankama is the practice of walking meditation, where mindfulness is maintained while walking slowly and deliberately, focusing on the physical sensations and movements."]}
{"id": "BUD024", "title": "Loving-kindness", "paragraphs": ["Metta meditation involves cultivating universal love and goodwill towards all beings, starting with oneself and gradually extending to others."]}
{"id": "BUD025", "title": "Insight Meditation", "paragraphs": ["Vipassana is the practice of developing insight into the true nature of reality through direct observation of physical and mental phenomena."]}
{"id": "BUD026", "title": "Breath Meditation", "paragraphs": ["Anapanasati is the practice of mindfulness of breathing, focusing attention on the natural flow of breath as a foundation for developing concentration."]}
{"id": "BUD027", "title": "Body Contemplation", "paragraphs": ["Kayanupassana involves mindful observation of the body, including postures, movements, and physical sensations."]}
{"id": "BUD028", "title": "Feeling Contemplation", "paragraphs": ["Vedananupassana is the practice of observing pleasant, unpleasant, and neutral feelings as they arise and pass away."]}
{"id": "BUD029", "title": "Mind Contemplation", "paragraphs": ["Cittanupassana involves observing the various states of mind, including their qualities and characteristics."]}
{"id": "BUD030", "title": "Dhamma Contemplation", "paragraphs": ["Dhammanupassana is the contemplation of mental objects and phenomena in light of Buddhist teachings."]}
{"id": "BUD031", "title": "Jhana", "paragraphs": ["States of deep meditation characterized by increasing levels of concentration and mental purification."]}
{"id": "BUD032", "title": "Contemplation of Death", "paragraphs": ["Maranasati is the meditation on death and impermanence, developing insight into the nature of existence."]}
{"id": "BUD033", "title": "Cemetery Meditation", "paragraphs": ["Sivisathika involves contemplation of decomposing bodies to understand impermanence and non-attachment."]}
{"id": "BUD034", "title": "Divine Ear", "paragraphs": ["Dibba-sota is the meditation-developed ability to hear subtle sounds and understand various levels of sound."]}
{"id": "BUD035", "title": "Kasina Practice", "paragraphs": ["Meditation using visual objects to develop concentration and access to jhanic states."]}
{"id": "BUD036", "title": "Recollection", "paragraphs": ["Anussati practices involve meditation on various subjects like the Buddha, Dhamma, Sangha, and one's own virtues."]}
{"id": "BUD037", "title": "Divine Eye", "paragraphs": ["Dibba-cakkhu represents the meditation-developed ability to see beyond ordinary visual perception."]}
{"id": "BUD038", "title": "Formless Realms", "paragraphs": ["Arupa-jhanas are the four highest meditation states transcending form-based concentration."]}
{"id": "BUD039", "title": "Mindfulness Bases", "paragraphs": ["Satipatthana represents the four foundations of mindfulness practice: body, feelings, mind, and phenomena."]}
{"id": "BUD040", "title": "Meditation Signs", "paragraphs": ["Nimitta refers to mental images or signs that arise during deep concentration practice."]}

{"id": "BUD041", "title": "Awakening", "paragraphs": ["Bodhi refers to the awakening or enlightenment experienced by the Buddha and his disciples, characterized by the complete understanding of the Four Noble Truths."]}
{"id": "BUD042", "title": "Stream-entry", "paragraphs": ["Sotapanna is the first stage of enlightenment, where one has unshakeable faith in the Buddha, Dhamma, and Sangha, and has eliminated the first three fetters."]}
{"id": "BUD043", "title": "Nirvana", "paragraphs": ["Nibbana is the ultimate goal of Buddhist practice, representing the complete cessation of suffering and the end of the cycle of rebirth."]}
{"id": "BUD044", "title": "Seven Factors", "paragraphs": ["The Seven Factors of Enlightenment (bojjhanga) are mindfulness, investigation, energy, joy, tranquility, concentration, and equanimity."]}
{"id": "BUD045", "title": "Bodhicitta", "paragraphs": ["The awakened mind or heart, representing the aspiration to achieve enlightenment for the benefit of all beings, particularly emphasized in Mahayana Buddhism."]}
{"id": "BUD046", "title": "Once-returner", "paragraphs": ["Sakadagami is the second stage of enlightenment, where greed, hatred, and delusion are significantly weakened."]}
{"id": "BUD047", "title": "Non-returner", "paragraphs": ["Anagami is the third stage of enlightenment, where all sensual desire and aversion are eliminated."]}
{"id": "BUD048", "title": "Arahant", "paragraphs": ["The fully enlightened being who has eliminated all fetters and achieved complete liberation from suffering."]}
{"id": "BUD049", "title": "Wisdom Eye", "paragraphs": ["Panna-cakkhu refers to the eye of wisdom that sees the true nature of reality, developed through practice and insight."]}
{"id": "BUD050", "title": "Perfect Understanding", "paragraphs": ["Samma-ditthi is right view or understanding, the first factor of the Noble Eightfold Path, essential for enlightenment."]}
{"id": "BUD051", "title": "Sudden Enlightenment", "paragraphs": ["The immediate realization of truth emphasized in some Buddhist traditions, particularly Zen."]}
{"id": "BUD052", "title": "Gradual Path", "paragraphs": ["The step-by-step approach to enlightenment through systematic practice and development."]}
{"id": "BUD053", "title": "Buddha Nature", "paragraphs": ["Tathagatagarbha refers to the inherent potential for enlightenment present in all beings."]}
{"id": "BUD054", "title": "Direct Perception", "paragraphs": ["Pratyaksha refers to direct, non-conceptual perception of reality achieved in enlightenment."]}
{"id": "BUD055", "title": "Complete Liberation", "paragraphs": ["Vimutti represents the total freedom from all mental defilements and suffering."]}
{"id": "BUD056", "title": "Stream Entry", "paragraphs": ["Sotapanna, the first stage of enlightenment where three fetters are broken: self-view, doubt about the Buddha's teachings, and attachment to rites and rituals."]}
{"id": "BUD057", "title": "Seven Factors of Enlightenment", "paragraphs": ["Satta bojjhanga: mindfulness, investigation, energy, joy, tranquility, concentration, and equanimity - qualities that lead to awakening."]}
{"id": "BUD058", "title": "Enlightened Mind", "paragraphs": ["Bodhicitta represents both the aspiration to achieve enlightenment for the benefit of all beings and the awakened mind itself."]}
{"id": "BUD059", "title": "Ten Fetters", "paragraphs": ["Dasa samyojana are the ten bonds that bind beings to samsara, which are progressively eliminated through the stages of enlightenment: self-identity views, doubt, attachment to rites and rituals, sensual desire, ill will, desire for form realm, desire for formless realm, conceit, restlessness, and ignorance."]}
{"id": "BUD060", "title": "Four Stages", "paragraphs": ["The progressive stages of enlightenment: Stream-enterer (Sotapanna), Once-returner (Sakadagami), Non-returner (Anagami), and Arahant, each marking deeper levels of liberation from mental defilements."]}

{"id": "BUD061", "title": "Emptiness", "paragraphs": ["Sunyata refers to the Buddhist concept of emptiness, teaching that all phenomena lack inherent existence and are dependent on causes and conditions."]}
{"id": "BUD062", "title": "Dependent Origination", "paragraphs": ["Paticca-samuppada explains how phenomena arise dependent on other phenomena, demonstrating the interconnected nature of all things."]}
{"id": "BUD063", "title": "Non-self", "paragraphs": ["Anatta is the teaching that there is no permanent, unchanging self or soul, one of the three characteristics of existence."]}
{"id": "BUD064", "title": "Impermanence", "paragraphs": ["Anicca refers to the constant change and impermanence of all conditioned phenomena, another key characteristic of existence."]}
{"id": "BUD065", "title": "Middle Way", "paragraphs": ["Madhyamaka philosophy emphasizes emptiness as the middle way between eternalism and nihilism, avoiding extreme views about existence."]}
{"id": "BUD066", "title": "Five Aggregates", "paragraphs": ["Khandhas are the five components of existence: form, feeling, perception, mental formations, and consciousness, all empty of inherent existence."]}
{"id": "BUD067", "title": "Conventional Truth", "paragraphs": ["Sammuti-sacca refers to conventional or relative truth, the apparent reality of phenomena in everyday experience."]}
{"id": "BUD068", "title": "Ultimate Truth", "paragraphs": ["Paramattha-sacca is the ultimate truth of emptiness and the true nature of reality beyond conventional appearances."]}
{"id": "BUD069", "title": "Selflessness", "paragraphs": ["Anatman teaches that no permanent self or soul exists in any phenomenon, revealing the empty nature of personal identity."]}
{"id": "BUD070", "title": "Two Truths", "paragraphs": ["The doctrine explaining the relationship between conventional and ultimate truth in understanding emptiness."]}
{"id": "BUD071", "title": "Interdependence", "paragraphs": ["The understanding that all phenomena exist in mutual dependence without independent existence."]}
{"id": "BUD072", "title": "Form is Emptiness", "paragraphs": ["The Heart Sutra teaching that form is empty of inherent existence and emptiness is form."]}
{"id": "BUD073", "title": "Nature of Mind", "paragraphs": ["The understanding that mind itself is empty of inherent existence yet luminous in nature."]}
{"id": "BUD074", "title": "Emptiness of Time", "paragraphs": ["The teaching that past, present, and future are empty of inherent existence."]}
{"id": "BUD075", "title": "Four Extremes", "paragraphs": ["The rejection of existence, non-existence, both, and neither in understanding emptiness."]}
{"id": "BUD076", "title": "Empty Nature", "paragraphs": ["Svabhava-sunyata teaches that phenomena lack any independent, inherent nature or self-existence."]}
{"id": "BUD077", "title": "Emptiness of Emptiness", "paragraphs": ["The understanding that even the concept of emptiness itself is empty of inherent existence."]}
{"id": "BUD078", "title": "Eighteen Emptinesses", "paragraphs": ["The detailed analysis of emptiness in different contexts as taught in Mahayana Buddhism."]}
{"id": "BUD079", "title": "Space-like Emptiness", "paragraphs": ["The metaphor of space used to understand emptiness - like space, it neither comes nor goes."]}
{"id": "BUD080", "title": "Wisdom of Emptiness", "paragraphs": ["Prajna-paramita, the perfection of wisdom that directly realizes the empty nature of all phenomena."]}

{"id": "BUD081", "title": "Compassion", "paragraphs": ["Karuna is the wish for all beings to be free from suffering, one of the four divine abodes (brahmaviharas)."]}
{"id": "BUD082", "title": "Sympathetic Joy", "paragraphs": ["Mudita represents joy in others' happiness and success, another of the four divine abodes."]}
{"id": "BUD083", "title": "Equanimity", "paragraphs": ["Upekkha is the balanced state of mind that views all beings with impartiality and acceptance, the fourth divine abode."]}
{"id": "BUD084", "title": "Altruistic Joy", "paragraphs": ["The practice of finding joy in others' well-being and happiness, cultivating a mind free from envy and jealousy."]}
{"id": "BUD085", "title": "Great Compassion", "paragraphs": ["Maha-karuna refers to the boundless compassion of the Buddha and bodhisattvas, extending to all beings without discrimination."]}
{"id": "BUD086", "title": "Bodhisattva Vow", "paragraphs": ["The commitment to achieve enlightenment for the benefit of all beings, motivated by great compassion."]}
{"id": "BUD087", "title": "Four Immeasurables", "paragraphs": ["Brahmaviharas: loving-kindness, compassion, sympathetic joy, and equanimity, cultivated through meditation practice."]}
{"id": "BUD088", "title": "Universal Love", "paragraphs": ["Metta represents boundless loving-kindness towards all beings without discrimination or attachment."]}
{"id": "BUD089", "title": "Compassionate Action", "paragraphs": ["Karuna in action involves actively working to alleviate the suffering of others through skillful means."]}
{"id": "BUD090", "title": "Wisdom and Compassion", "paragraphs": ["The union of wisdom (prajna) and compassion (karuna) represents the perfect balance of Buddhist practice."]}
{"id": "BUD091", "title": "Skillful Means", "paragraphs": ["Upaya refers to compassionate methods used to help beings according to their capacity."]}
{"id": "BUD092", "title": "Dedication of Merit", "paragraphs": ["The practice of sharing the benefits of one's good actions with all beings out of compassion."]}
{"id": "BUD093", "title": "Noble Friend", "paragraphs": ["Kalyanamitra is one who helps others on the path with wisdom and compassion."]}
{"id": "BUD094", "title": "Compassionate Listening", "paragraphs": ["The practice of listening deeply to others with full attention and understanding."]}
{"id": "BUD095", "title": "Active Compassion", "paragraphs": ["The practical application of compassion through beneficial actions and service to others."]}
{"id": "BUD096", "title": "Six Paramitas", "paragraphs": ["The perfections of generosity, ethics, patience, effort, meditation, and wisdom practiced with compassion."]}
{"id": "BUD097", "title": "Three Marks", "paragraphs": ["The characteristics of impermanence, suffering, and non-self that mark all conditioned existence."]}
{"id": "BUD098", "title": "Four Noble Truths", "paragraphs": ["The Buddha's fundamental teaching on suffering, its cause, cessation, and the path to liberation."]}
{"id": "BUD099", "title": "Eightfold Path", "paragraphs": ["The Buddhist path of practice leading to the cessation of suffering and realization of Nirvana."]}
{"id": "BUD100", "title": "Buddha Nature", "paragraphs": ["The fundamental potential for awakening present in all beings, though often obscured by defilements."]}

